---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SculptingFailures
source: html/6774602a-4e06-4d38-43e2-58f3ef3277ef.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SculptingFailures

Failures about Sculpting.

## Syntax (C#)
```csharp
public static class SculptingFailures
```